## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket_notification.bucket_notification will be created
+   resource "aws_s3_bucket_notification" "bucket_notification" {
+       bucket      = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+       eventbridge = false
+       id          = (known after apply)

+       lambda_function {
+           events              = [
+               "s3:ObjectCreated:*",
            ]
+           filter_prefix       = "sources/"
+           filter_suffix       = "/grants.gov/extract.xml"
+           id                  = (known after apply)
+           lambda_function_arn = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB"
        }
+       lambda_function {
+           events              = [
+               "s3:ObjectCreated:*",
            ]
+           filter_prefix       = "sources/"
+           filter_suffix       = "/ffis/raw.eml"
+           id                  = (known after apply)
+           lambda_function_arn = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload"
        }
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.aws_s3_bucket_notification.default will be destroyed
  # (because aws_s3_bucket_notification.default is not in configuration)
-   resource "aws_s3_bucket_notification" "default" {
-       bucket      = "grantsingest-staging-grantssourcedata-357150818708-us-west-2" -> null
-       eventbridge = false -> null
-       id          = "grantsingest-staging-grantssourcedata-357150818708-us-west-2" -> null

-       lambda_function {
-           events              = [
-               "s3:ObjectCreated:*",
            ] -> null
-           filter_prefix       = "sources/" -> null
-           filter_suffix       = "/grants.gov/extract.xml" -> null
-           id                  = "tf-s3-lambda-20230428182841935700000003" -> null
-           lambda_function_arn = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB" -> null
        }
    }

  # module.SplitGrantsGovXMLDB.aws_s3_bucket_notification.default will be destroyed
  # (because aws_s3_bucket_notification.default is not in configuration)
-   resource "aws_s3_bucket_notification" "default" {
-       bucket      = "grantsingest-staging-grantssourcedata-357150818708-us-west-2" -> null
-       eventbridge = false -> null
-       id          = "grantsingest-staging-grantssourcedata-357150818708-us-west-2" -> null

-       lambda_function {
-           events              = [
-               "s3:ObjectCreated:*",
            ] -> null
-           filter_prefix       = "sources/" -> null
-           filter_suffix       = "/grants.gov/extract.xml" -> null
-           id                  = "tf-s3-lambda-20230428182841935700000003" -> null
-           lambda_function_arn = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB" -> null
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-04-28T23:51:02.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:24" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:24/invocations" -> (known after apply)
      ~ s3_key                         = "builds/81683e0240749a994abc5148bc340765f79addc733815f89bd434a7a0d0a93fc.zip" -> "builds/7bf78e030283071600762959ea3789477c41697b782ecbf0a48d81d28f8bc687.zip"
      ~ s3_object_version              = "F9sr.5NVudkA9kpWwtfVDU5Fe1uEJYeU" -> (known after apply)
        tags                           = {}
      ~ version                        = "24" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:409a18a511edb412fc2ad7bf89ae02e35df90b86,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:591f183cc2648477779ff6cb5521b4e663f9877b,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "409a18a511edb412fc2ad7bf89ae02e35df90b86" -> "591f183cc2648477779ff6cb5521b4e663f9877b"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "24" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "8f4666f9e7f62dd3f4146e826c4bd8bc-2" -> (known after apply)
      ~ id                     = "builds/81683e0240749a994abc5148bc340765f79addc733815f89bd434a7a0d0a93fc.zip" -> (known after apply)
      ~ key                    = "builds/81683e0240749a994abc5148bc340765f79addc733815f89bd434a7a0d0a93fc.zip" -> "builds/7bf78e030283071600762959ea3789477c41697b782ecbf0a48d81d28f8bc687.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/81683e0240749a994abc5148bc340765f79addc733815f89bd434a7a0d0a93fc.zip" -> "builds/7bf78e030283071600762959ea3789477c41697b782ecbf0a48d81d28f8bc687.zip"
-       tags                   = {} -> null
      ~ version_id             = "F9sr.5NVudkA9kpWwtfVDU5Fe1uEJYeU" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/7bf78e030283071600762959ea3789477c41697b782ecbf0a48d81d28f8bc687.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/7bf78e030283071600762959ea3789477c41697b782ecbf0a48d81d28f8bc687.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8739072787808401214" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/81683e0240749a994abc5148bc340765f79addc733815f89bd434a7a0d0a93fc.zip" -> "builds/7bf78e030283071600762959ea3789477c41697b782ecbf0a48d81d28f8bc687.zip"
          ~ "timestamp" = "1682725832141446200" -> "1682736322692898000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5996219211956275743" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/81683e0240749a994abc5148bc340765f79addc733815f89bd434a7a0d0a93fc.zip" -> "builds/7bf78e030283071600762959ea3789477c41697b782ecbf0a48d81d28f8bc687.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-04-28T23:51:06.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:4/invocations" -> (known after apply)
      ~ s3_key                         = "builds/23d83563f2932a849f75c9aa6a75e6cf1e85f281a1b3f946aaa2b6426b68fbb0.zip" -> "builds/c01064f8b42e7db15a02d3fb4560f025fa6f6c0daac21e2503abd4a553d9bc4a.zip"
      ~ s3_object_version              = "2CZJc.C1rUm3gng7YtGEYOQiKBIOIug6" -> (known after apply)
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:409a18a511edb412fc2ad7bf89ae02e35df90b86,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:591f183cc2648477779ff6cb5521b4e663f9877b,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "409a18a511edb412fc2ad7bf89ae02e35df90b86" -> "591f183cc2648477779ff6cb5521b4e663f9877b"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "4" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "bb80b6881ff209a18afb7c652295cf4f-2" -> (known after apply)
      ~ id                     = "builds/23d83563f2932a849f75c9aa6a75e6cf1e85f281a1b3f946aaa2b6426b68fbb0.zip" -> (known after apply)
      ~ key                    = "builds/23d83563f2932a849f75c9aa6a75e6cf1e85f281a1b3f946aaa2b6426b68fbb0.zip" -> "builds/c01064f8b42e7db15a02d3fb4560f025fa6f6c0daac21e2503abd4a553d9bc4a.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/23d83563f2932a849f75c9aa6a75e6cf1e85f281a1b3f946aaa2b6426b68fbb0.zip" -> "builds/c01064f8b42e7db15a02d3fb4560f025fa6f6c0daac21e2503abd4a553d9bc4a.zip"
-       tags                   = {} -> null
      ~ version_id             = "2CZJc.C1rUm3gng7YtGEYOQiKBIOIug6" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/c01064f8b42e7db15a02d3fb4560f025fa6f6c0daac21e2503abd4a553d9bc4a.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/c01064f8b42e7db15a02d3fb4560f025fa6f6c0daac21e2503abd4a553d9bc4a.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "9135149136820495830" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/23d83563f2932a849f75c9aa6a75e6cf1e85f281a1b3f946aaa2b6426b68fbb0.zip" -> "builds/c01064f8b42e7db15a02d3fb4560f025fa6f6c0daac21e2503abd4a553d9bc4a.zip"
          ~ "timestamp" = "1682725844896953200" -> "1682736335382724000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6032903894527895732" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/23d83563f2932a849f75c9aa6a75e6cf1e85f281a1b3f946aaa2b6426b68fbb0.zip" -> "builds/c01064f8b42e7db15a02d3fb4560f025fa6f6c0daac21e2503abd4a553d9bc4a.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-04-28T23:51:02.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:23" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:23/invocations" -> (known after apply)
      ~ s3_key                         = "builds/981756d355d8cddd630ca452e41d52bcc15b0760fdb1256c37b8afc6afe5a931.zip" -> "builds/f3079eadaba6e6b85c4a2fb54f2630f62cc46241f52069f18ea90c957f536aa1.zip"
      ~ s3_object_version              = "yLrruJuyRlREw3D70u3Auj.rZcasrIf3" -> (known after apply)
        tags                           = {}
      ~ version                        = "23" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:409a18a511edb412fc2ad7bf89ae02e35df90b86,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:591f183cc2648477779ff6cb5521b4e663f9877b,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "409a18a511edb412fc2ad7bf89ae02e35df90b86" -> "591f183cc2648477779ff6cb5521b4e663f9877b"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "23" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "f5d282119d5d5ea7e3271cf95861e4d8-2" -> (known after apply)
      ~ id                     = "builds/981756d355d8cddd630ca452e41d52bcc15b0760fdb1256c37b8afc6afe5a931.zip" -> (known after apply)
      ~ key                    = "builds/981756d355d8cddd630ca452e41d52bcc15b0760fdb1256c37b8afc6afe5a931.zip" -> "builds/f3079eadaba6e6b85c4a2fb54f2630f62cc46241f52069f18ea90c957f536aa1.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/981756d355d8cddd630ca452e41d52bcc15b0760fdb1256c37b8afc6afe5a931.zip" -> "builds/f3079eadaba6e6b85c4a2fb54f2630f62cc46241f52069f18ea90c957f536aa1.zip"
-       tags                   = {} -> null
      ~ version_id             = "yLrruJuyRlREw3D70u3Auj.rZcasrIf3" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/f3079eadaba6e6b85c4a2fb54f2630f62cc46241f52069f18ea90c957f536aa1.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/f3079eadaba6e6b85c4a2fb54f2630f62cc46241f52069f18ea90c957f536aa1.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2727617601027088418" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/981756d355d8cddd630ca452e41d52bcc15b0760fdb1256c37b8afc6afe5a931.zip" -> "builds/f3079eadaba6e6b85c4a2fb54f2630f62cc46241f52069f18ea90c957f536aa1.zip"
          ~ "timestamp" = "1682725832143114000" -> "1682736322666426800"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4069294848935111589" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/981756d355d8cddd630ca452e41d52bcc15b0760fdb1256c37b8afc6afe5a931.zip" -> "builds/f3079eadaba6e6b85c4a2fb54f2630f62cc46241f52069f18ea90c957f536aa1.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 16 to add, 7 to change, 14 to destroy.
```

</details>

*Pusher: @slapula, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4836495854)*